import java.util.Scanner;

public class HW3 {
    /*Пользователь вводит с клавиатуры три целочисленных значения.
     На экран выводится информация можно ли из этих сторон построить треугольник.
    (необходимо вспомнить правило построения треугольника по трем сторонам).

*/
//    public static void main(String[] args) {
//        System.out.println("Enter text");
//        Scanner neo = new Scanner(System.in);
//        int var1 = neo.nextInt();
//        int var2 = neo.nextInt();
//        int var3 = neo.nextInt();
//        if (var1+var2>var3 && var1+var3>var2 && var3+var2>var1) {
//            System.out.println("Triangle");
//        } else {
//            System.out.println("Not Triangle");
//        }
//    }
    /*При помощи тернарного оператора необходимо получить разность двух чисел введенных с клавиатуры,
     и всегда отнимать от большего меньшее.
    Вывести эту разность в консоль.*/

//    public static void main(String[] args) {
//        System.out.println("Enter values");
//        Scanner neo = new Scanner(System.in);
//        int var1 = neo.nextInt();
//        int var2 = neo.nextInt();
//        System.out.println(var1 > var2 ? var1 - var2 : var2 - var1);
//    }
    /*Написать программу, используя тернарный оператор, где пользователь вводит с клавиатуры
     два числа и символ – или + или % или / или *. На экран выводится резултат действия над двумя введенными числами.
     Если пользователь ввел что-то кроме данных символов, то необходимо вывести 0.*/
//    public static void main(String[] args) {
//        System.out.println("Enter values");
//        Scanner neo = new Scanner(System.in);
//        int var1 = neo.nextInt();
//        int var2 = neo.nextInt();
//        System.out.println("Enter symbol");
//        char var3 = neo.next().charAt(0);
//        switch (var3) {
//            case '+' -> System.out.println(var1 + var2);
//            case '-' -> System.out.println(var1 - var2);
//            case '%' -> System.out.println(var1 % var2);
//            case '/' -> System.out.println(var1 / var2);
//            case '*' -> System.out.println(var1 * var2);
//        }
//    }
}
